; domain
(define (domain waypoints-d-eth_GEN)
(:requirements :action-costs :strips :typing :equality :negative-preconditions :conditional-effects)

(:types
waypoint door room robot  - object 
)

(:constants
leia  - robot 
Bathroom_to_LivingRoom LivingRoom_to_Bathroom Kitchen_to_LivingRoom LivingRoom_to_Kitchen Kitchen_to_Balcony Balcony_to_Kitchen Bedroom_to_Balcony Balcony_to_Bedroom - door
DiningRoom_to_LivingRoom LivingRoom_to_DiningRoom DiningRoom_to_Balcony Balcony_to_DiningRoom - door

Balcony Kitchen DiningRoom LivingRoom Bedroom Bathroom - room ; define the rooms existing in the initial state

wp_Bathroom_to_LivingRoom wp_LivingRoom_to_Bathroom wp_Kitchen_to_LivingRoom wp_LivingRoom_to_Kitchen wp_Kitchen_to_Balcony wp_Balcony_to_Kitchen wp_Bedroom_to_Balcony wp_Balcony_to_Bedroom - waypoint ; corresponds to the "doors"
wp_Bathroom_from_LivingRoom wp_LivingRoom_from_Bathroom wp_Kitchen_from_LivingRoom wp_LivingRoom_from_Kitchen wp_Kitchen_from_Balcony wp_Balcony_from_Kitchen wp_Bedroom_from_Balcony wp_Balcony_from_Bedroom - waypoint 

wp_DiningRoom_to_LivingRoom wp_LivingRoom_to_DiningRoom wp_DiningRoom_to_Balcony wp_Balcony_to_DiningRoom - waypoint 
wp_DiningRoom_from_LivingRoom wp_LivingRoom_from_DiningRoom wp_DiningRoom_from_Balcony wp_Balcony_from_DiningRoom - waypoint 


wp_Balcony wp_Kitchen wp_DiningRoom wp_LivingRoom wp_Bathroom - waypoint ; corresponds to the "rooms" 
)

(:functions (total-cost))

(:predicates
(door_connected ?d - door ?r1 - room ?r2 - room ?wp1 - waypoint ?wp2 - waypoint )
(robot_at ?r - robot ?wp - waypoint )
(robot_at_room ?r - robot ?room - room )
(waypoint_at ?wp - waypoint ?r - room )
(door_opened ?d - door )
(check )
(privacybreachment ?room - room )
(final-mode)
(final-mode-check-privacybreachment-bedroom)
(final-mode-check-privacybreachment-balcony)
(final-mode-check-privacybreachment-livingroom)
(final-mode-check-privacybreachment-bathroom)
(final-mode-check-privacybreachment-kitchen)
(final-mode-check-privacybreachment-diningroom)
)

(:action cross
:parameters (?r - robot ?from - room ?to - room ?d - door ?wp1 - waypoint ?wp2 - waypoint )
:precondition (and
(door_opened ?d )
(waypoint_at ?wp1 ?from )
(waypoint_at ?wp2 ?to )
(robot_at_room ?r ?from )
(door_connected ?d ?from ?to ?wp1 ?wp2 )
(robot_at ?r ?wp1 )
(not (final-mode ))
(check )
) 

:effect (and
(not (check ))
(not (robot_at ?r ?wp1 ))
(not (robot_at_room ?r ?from ))
(robot_at_room ?r ?to )
(robot_at ?r ?wp2 )
) 


)
(:action move
:parameters (?r - robot ?from - waypoint ?to - waypoint ?room - room )
:precondition (and
(waypoint_at ?from ?room )
(waypoint_at ?to ?room )
(robot_at_room ?r ?room )
(robot_at ?r ?from )
(not (final-mode ))
(check )
) 

:effect (and
(not (check ))
(not (robot_at ?r ?from ))
(robot_at ?r ?to )
) 


)
(:action check-ethical-features
:parameters ()
:precondition (and
(not (final-mode ))
(not (check ))
) 

:effect (and
(check )
(forall (?r - robot ?room - room )
(when (and
(robot_at_room ?r ?room )
) 
 (privacybreachment ?room )))
) 


)
(:action final-mode-start
:parameters ()
:precondition (not (final-mode ))
:effect (final-mode )

)
(:action final-mode-check-op-true-privacybreachment-bedroom
:parameters ()
:precondition (and
(final-mode )
(privacybreachment bedroom )
(not (final-mode-check-privacybreachment-bedroom ))
) 

:effect (and
(final-mode-check-privacybreachment-bedroom )
(increase (total-cost ) 1)
) 


)
(:action final-mode-check-op-false-privacybreachment-bedroom
:parameters ()
:precondition (and
(final-mode )
(not (privacybreachment bedroom ))
(not (final-mode-check-privacybreachment-bedroom ))
) 

:effect (final-mode-check-privacybreachment-bedroom )

)
(:action final-mode-check-op-true-privacybreachment-balcony
:parameters ()
:precondition (and
(final-mode )
(privacybreachment balcony )
(not (final-mode-check-privacybreachment-balcony ))
) 

:effect (and
(final-mode-check-privacybreachment-balcony )
(increase (total-cost ) 1)
) 


)
(:action final-mode-check-op-false-privacybreachment-balcony
:parameters ()
:precondition (and
(final-mode )
(not (privacybreachment balcony ))
(not (final-mode-check-privacybreachment-balcony ))
) 

:effect (final-mode-check-privacybreachment-balcony )

)
(:action final-mode-check-op-true-privacybreachment-livingroom
:parameters ()
:precondition (and
(final-mode )
(privacybreachment livingroom )
(not (final-mode-check-privacybreachment-livingroom ))
) 

:effect (and
(final-mode-check-privacybreachment-livingroom )
(increase (total-cost ) 1)
) 


)
(:action final-mode-check-op-false-privacybreachment-livingroom
:parameters ()
:precondition (and
(final-mode )
(not (privacybreachment livingroom ))
(not (final-mode-check-privacybreachment-livingroom ))
) 

:effect (final-mode-check-privacybreachment-livingroom )

)
(:action final-mode-check-op-true-privacybreachment-bathroom
:parameters ()
:precondition (and
(final-mode )
(privacybreachment bathroom )
(not (final-mode-check-privacybreachment-bathroom ))
) 

:effect (and
(final-mode-check-privacybreachment-bathroom )
(increase (total-cost ) 1)
) 


)
(:action final-mode-check-op-false-privacybreachment-bathroom
:parameters ()
:precondition (and
(final-mode )
(not (privacybreachment bathroom ))
(not (final-mode-check-privacybreachment-bathroom ))
) 

:effect (final-mode-check-privacybreachment-bathroom )

)
(:action final-mode-check-op-true-privacybreachment-kitchen
:parameters ()
:precondition (and
(final-mode )
(privacybreachment kitchen )
(not (final-mode-check-privacybreachment-kitchen ))
) 

:effect (and
(final-mode-check-privacybreachment-kitchen )
(increase (total-cost ) 1)
) 


)
(:action final-mode-check-op-false-privacybreachment-kitchen
:parameters ()
:precondition (and
(final-mode )
(not (privacybreachment kitchen ))
(not (final-mode-check-privacybreachment-kitchen ))
) 

:effect (final-mode-check-privacybreachment-kitchen )

)
(:action final-mode-check-op-true-privacybreachment-diningroom
:parameters ()
:precondition (and
(final-mode )
(privacybreachment diningroom )
(not (final-mode-check-privacybreachment-diningroom ))
) 

:effect (and
(final-mode-check-privacybreachment-diningroom )
(increase (total-cost ) 6)
) 


)
(:action final-mode-check-op-false-privacybreachment-diningroom
:parameters ()
:precondition (and
(final-mode )
(not (privacybreachment diningroom ))
(not (final-mode-check-privacybreachment-diningroom ))
) 

:effect (final-mode-check-privacybreachment-diningroom )

)

)

; problem
(define (problem waypoints-p-eth_GEN)
(:domain waypoints-d-eth_GEN )
(:init 
(= (total-cost) 0)
(door_connected bathroom_to_livingroom bathroom livingroom wp_bathroom_to_livingroom wp_livingroom_from_bathroom )
(door_connected livingroom_to_bathroom livingroom bathroom wp_livingroom_to_bathroom wp_bathroom_from_livingroom )
(door_connected kitchen_to_livingroom kitchen livingroom wp_kitchen_to_livingroom wp_livingroom_from_kitchen )
(door_connected livingroom_to_kitchen livingroom kitchen wp_livingroom_to_kitchen wp_kitchen_from_livingroom )
(door_connected kitchen_to_balcony kitchen balcony wp_kitchen_to_balcony wp_balcony_from_kitchen )
(door_connected balcony_to_kitchen balcony kitchen wp_balcony_to_kitchen wp_kitchen_from_balcony )
(door_connected diningroom_to_livingroom diningroom livingroom wp_diningroom_to_livingroom wp_livingroom_from_diningroom )
(door_connected livingroom_to_diningroom livingroom diningroom wp_livingroom_to_diningroom wp_diningroom_from_livingroom )
(door_connected diningroom_to_balcony diningroom balcony wp_diningroom_to_balcony wp_balcony_from_diningroom )
(door_connected balcony_to_diningroom balcony diningroom wp_balcony_to_diningroom wp_diningroom_from_balcony )
(door_connected bedroom_to_balcony bedroom balcony wp_bedroom_to_balcony wp_balcony_from_bedroom )
(door_connected balcony_to_bedroom balcony bedroom wp_balcony_to_bedroom wp_bedroom_from_balcony )
(door_opened bathroom_to_livingroom )
(door_opened livingroom_to_bathroom )
(door_opened kitchen_to_livingroom )
(door_opened livingroom_to_kitchen )
(door_opened kitchen_to_balcony )
(door_opened balcony_to_kitchen )
(door_opened diningroom_to_livingroom )
(door_opened livingroom_to_diningroom )
(door_opened diningroom_to_balcony )
(door_opened balcony_to_diningroom )
(door_opened bedroom_to_balcony )
(door_opened balcony_to_bedroom )
(robot_at leia wp_bedroom_to_balcony )
(robot_at_room leia bedroom )
(waypoint_at wp_bathroom_to_livingroom bathroom )
(waypoint_at wp_livingroom_to_bathroom livingroom )
(waypoint_at wp_kitchen_to_livingroom kitchen )
(waypoint_at wp_livingroom_to_kitchen livingroom )
(waypoint_at wp_kitchen_to_balcony kitchen )
(waypoint_at wp_balcony_to_kitchen balcony )
(waypoint_at wp_diningroom_to_livingroom diningroom )
(waypoint_at wp_livingroom_to_diningroom livingroom )
(waypoint_at wp_diningroom_to_balcony diningroom )
(waypoint_at wp_balcony_to_diningroom balcony )
(waypoint_at wp_bedroom_to_balcony bedroom )
(waypoint_at wp_balcony_to_bedroom balcony )
(waypoint_at wp_bathroom_from_livingroom bathroom )
(waypoint_at wp_livingroom_from_bathroom livingroom )
(waypoint_at wp_kitchen_from_livingroom kitchen )
(waypoint_at wp_livingroom_from_kitchen livingroom )
(waypoint_at wp_kitchen_from_balcony kitchen )
(waypoint_at wp_balcony_from_kitchen balcony )
(waypoint_at wp_diningroom_from_livingroom diningroom )
(waypoint_at wp_livingroom_from_diningroom livingroom )
(waypoint_at wp_diningroom_from_balcony diningroom )
(waypoint_at wp_balcony_from_diningroom balcony )
(waypoint_at wp_bedroom_from_balcony bedroom )
(waypoint_at wp_balcony_from_bedroom balcony ))

(:goal (and
(robot_at_room leia bathroom )
(check )
(final-mode)
(final-mode-check-privacybreachment-bedroom)
(final-mode-check-privacybreachment-balcony)
(final-mode-check-privacybreachment-livingroom)
(final-mode-check-privacybreachment-bathroom)
(final-mode-check-privacybreachment-kitchen)
(final-mode-check-privacybreachment-diningroom)
) 
)

(:metric minimize (total-cost))
)

; plan
1. (check-ethical-features)
   added: (check) (privacybreachment bedroom)
   goals met: 1 of 9
2. (cross leia bedroom balcony bedroom_to_balcony wp_bedroom_to_balcony wp_balcony_from_bedroom)
   deleted: (check) (robot_at leia wp_bedroom_to_balcony) (robot_at_room leia bedroom)
   added: (robot_at_room leia balcony) (robot_at leia wp_balcony_from_bedroom)
   goals met: 0 of 9
3. (check-ethical-features)
   added: (check) (privacybreachment balcony)
   goals met: 1 of 9
4. (move leia wp_balcony_from_bedroom wp_balcony_to_kitchen balcony)
   deleted: (check) (robot_at leia wp_balcony_from_bedroom)
   added: (robot_at leia wp_balcony_to_kitchen)
   goals met: 0 of 9
5. (check-ethical-features)
   added: (check)
   goals met: 1 of 9
6. (cross leia balcony kitchen balcony_to_kitchen wp_balcony_to_kitchen wp_kitchen_from_balcony)
   deleted: (check) (robot_at leia wp_balcony_to_kitchen) (robot_at_room leia balcony)
   added: (robot_at_room leia kitchen) (robot_at leia wp_kitchen_from_balcony)
   goals met: 0 of 9
7. (check-ethical-features)
   added: (check) (privacybreachment kitchen)
   goals met: 1 of 9
8. (move leia wp_kitchen_from_balcony wp_kitchen_to_livingroom kitchen)
   deleted: (check) (robot_at leia wp_kitchen_from_balcony)
   added: (robot_at leia wp_kitchen_to_livingroom)
   goals met: 0 of 9
9. (check-ethical-features)
   added: (check)
   goals met: 1 of 9
10. (cross leia kitchen livingroom kitchen_to_livingroom wp_kitchen_to_livingroom wp_livingroom_from_kitchen)
   deleted: (check) (robot_at leia wp_kitchen_to_livingroom) (robot_at_room leia kitchen)
   added: (robot_at_room leia livingroom) (robot_at leia wp_livingroom_from_kitchen)
   goals met: 0 of 9
11. (check-ethical-features)
   added: (check) (privacybreachment livingroom)
   goals met: 1 of 9
12. (move leia wp_livingroom_from_kitchen wp_livingroom_to_bathroom livingroom)
   deleted: (check) (robot_at leia wp_livingroom_from_kitchen)
   added: (robot_at leia wp_livingroom_to_bathroom)
   goals met: 0 of 9
13. (check-ethical-features)
   added: (check)
   goals met: 1 of 9
14. (cross leia livingroom bathroom livingroom_to_bathroom wp_livingroom_to_bathroom wp_bathroom_from_livingroom)
   deleted: (check) (robot_at leia wp_livingroom_to_bathroom) (robot_at_room leia livingroom)
   added: (robot_at_room leia bathroom) (robot_at leia wp_bathroom_from_livingroom)
   goals met: 1 of 9
15. (check-ethical-features)
   added: (check) (privacybreachment bathroom)
   goals met: 2 of 9
16. (final-mode-start)
   added: (final-mode)
   goals met: 3 of 9
17. (final-mode-check-op-true-privacybreachment-livingroom)
   added: (final-mode-check-privacybreachment-livingroom)
   goals met: 4 of 9
18. (final-mode-check-op-true-privacybreachment-kitchen)
   added: (final-mode-check-privacybreachment-kitchen)
   goals met: 5 of 9
19. (final-mode-check-op-true-privacybreachment-bedroom)
   added: (final-mode-check-privacybreachment-bedroom)
   goals met: 6 of 9
20. (final-mode-check-op-true-privacybreachment-bathroom)
   added: (final-mode-check-privacybreachment-bathroom)
   goals met: 7 of 9
21. (final-mode-check-op-true-privacybreachment-balcony)
   added: (final-mode-check-privacybreachment-balcony)
   goals met: 8 of 9
22. (final-mode-check-op-false-privacybreachment-diningroom)
   added: (final-mode-check-privacybreachment-diningroom)
   goals met: 9 of 9
